; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-5-233)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p4-0 - location
	p4-2 - location
	p4-3 - location
	p5-3 - location
	p5-4 - location
	p1-0 - location
	p2-0 - location
	p0-3 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s4)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s1)
	(at package2 s3)
	(at package3 s2)
	(at package4 s5)
	(at package5 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 58)
	(= (time-to-walk p4-0 s4) 58)
	(= (time-to-walk s0 p4-0) 18)
	(= (time-to-walk p4-0 s0) 18)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 7)
	(= (time-to-walk p4-2 s4) 7)
	(= (time-to-walk s2 p4-2) 38)
	(= (time-to-walk p4-2 s2) 38)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 61)
	(= (time-to-walk p4-3 s4) 61)
	(= (time-to-walk s3 p4-3) 35)
	(= (time-to-walk p4-3 s3) 35)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 25)
	(= (time-to-walk p5-3 s5) 25)
	(= (time-to-walk s3 p5-3) 26)
	(= (time-to-walk p5-3 s3) 26)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 16)
	(= (time-to-walk p5-4 s5) 16)
	(= (time-to-walk s4 p5-4) 7)
	(= (time-to-walk p5-4 s4) 7)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 40)
	(= (time-to-walk p1-0 s1) 40)
	(= (time-to-walk s0 p1-0) 6)
	(= (time-to-walk p1-0 s0) 6)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 43)
	(= (time-to-walk p2-0 s2) 43)
	(= (time-to-walk s0 p2-0) 57)
	(= (time-to-walk p2-0 s0) 57)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 42)
	(= (time-to-walk p0-3 s0) 42)
	(= (time-to-walk s3 p0-3) 36)
	(= (time-to-walk p0-3 s3) 36)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 25)
	(= (time-to-drive s1 s2) 25)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 13)
	(= (time-to-drive s4 s2) 13)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 25)
	(= (time-to-drive s1 s4) 25)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 34)
	(= (time-to-drive s2 s0) 34)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 58)
	(= (time-to-drive s4 s0) 58)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 49)
	(= (time-to-drive s0 s3) 49)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 2)
	(= (time-to-drive s2 s3) 2)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 7)
	(= (time-to-drive s4 s5) 7)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at truck1 s0)
	(at package1 s0)
	(at package2 s4)
	(at package3 s3)
	(at package4 s3)
	(at package5 s4)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 7
2. (walk driver1 s3 p0-3)
   deleted: (at driver1 s3)
   added: (at driver1 p0-3)
   goals met: 2 of 7
3. (drive-truck truck2 s4 s2 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 130
   goals met: 2 of 7
4. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 7
5. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 130 to 152
   goals met: 2 of 7
6. (unload-truck package3 truck2 s3)
   deleted: (in package3 truck2)
   added: (at package3 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 7
7. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 7
8. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 152 to 691
   goals met: 3 of 7
9. (walk driver1 p0-3 s0)
   deleted: (at driver1 p0-3)
   added: (at driver1 s0)
   goals met: 4 of 7
10. (drive-truck truck2 s0 s4 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 691 to 1329
   goals met: 4 of 7
11. (unload-truck package2 truck2 s4)
   deleted: (in package2 truck2)
   added: (at package2 s4)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 7
12. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 1329 to 1579
   goals met: 5 of 7
13. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 7
14. (drive-truck truck2 s1 s4 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (fuel-used) from 1579 to 1854
   goals met: 5 of 7
15. (drive-truck truck2 s4 s0 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 1854 to 2492
   goals met: 5 of 7
16. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 7
17. (drive-truck truck2 s0 s4 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 2492 to 3072
   goals met: 6 of 7
18. (drive-truck truck2 s4 s5 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 3072 to 3142
   goals met: 6 of 7
19. (load-truck package4 truck2 s5)
   deleted: (at package4 s5)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 7
20. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 3142 to 3219
   goals met: 6 of 7
21. (drive-truck truck2 s4 s2 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 3219 to 3362
   goals met: 6 of 7
22. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 3362 to 3384
   goals met: 6 of 7
23. (unload-truck package4 truck2 s3)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 7
